Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བསྟི་སྟང་དུ་བྱའོ། །མཆོད་པར་བྱའོ་སྙམ་དུ་མི་སེམས་སོ། །དེ་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཅི་སྟོན་པ་དེ་དག་ཐམས་ཅད་ལྷའི་རྣ་བས་མཉན་པར་བྱའོ།
en: Nor do they think, ‘I should listen with divine clairaudience to whatever teachings the lord buddhas are giving.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་སེམས་ཀྱིས་ཤེས་པར་བྱའོ།
en: I should understand with my mind the minds of the beings inhabiting those world systems.

source: །དེ་དག་གི་སྔོན་གྱི་གནས་བདག་གིས་རྗེས་སུ་དྲན་པར་བྱའོ།
en: I should recollect their past lives.

source: །ལྷའི་མིག་གིས་སེམས་ཅན་དེ་དག་འཆི་འཕོ་བ་དང་སྐྱེ་བ་དང་། སྐྱེས་པར་གྱུར་པ་རྣམས་བདག་གིས་མཐོང་བར་བྱའོ།
en: I should see with divine clairvoyance their death, transmigration, rebirth, and series of former lives. {

source: །སེམས་ཅན་གྲངས་མེད་ཚད་མེད་པ་དག་བདག་གིས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ་སྙམ་དུ་མི་སེམས་ཏེ།
en: Dt.55} I should enable countless, inestimable beings to pass into final nirvāṇa!’

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདུད་གླགས་ཚོལ་ཞིང་ཉམས་བསྐྱོང་པ་རྣམས་ཀྱིས་ཀྱང་གླགས་མི་རྙེད་དེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, even māras who seek to intrude and cause them disturbance would find no such opportunity.

source: འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་བྱ་བ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷུན་གྱིས་གྲུབ་པ་དང་། ཡོངས་སུ་བརྟག་པ་མེད་པར་འཐུན་པར་འགྲུབ་པོ།
en: All mundane and supramundane activities, as many as they are, will be spontaneously accomplished, and harmoniously fulfilled, without requiring further investigation.

source: །འཇིག་རྟེན་པའི་ཉོན་མོངས་པ་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་བསལ་བར་འགྱུར་རོ།
en: All mundane afflicted mental states that there are will also be dispelled.

source: །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་པ་དེ་དག་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ། ཉན་ཐོས་ཀྱི་ས་འམ་རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་དུ་འོང་ངོ་ཞེས་བསྲུང་བ་མཛད་དོ། །རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་།
en: All lord buddhas who are present in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, will also protect those bodhisattva great beings, lest they regress to the level of the śrāvakas or the level of the pratyekabuddhas.

source: གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་། ཚངས་རིས་ཀྱི་ལྷ་རྣམས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་།
en: The gods of Caturmahā­rāja­kāyika and Trayastriṃśa, the gods of Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin, along with the gods of Brahmakāyika, and the gods of Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha will also protect those bodhisattva great beings, lest certain obstacles occur.

source: ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ། ལ་ལ་ཞིག་བར་ཆད་བྱེད་པར་འགྱུར་དུ་འོང་ངོ་ཞེས་ཡོངས་སུ་བསྲུང་བ་བྱེད་དོ། །དེ་ལ་ལུས་ཀྱི་སྐྱོན་དུ་བྱ་བ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ཚེ་འདི་ཉིད་ལ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པར་འགྱུར་རོ།
en: All the physical defects that they may have will also be completely eliminated in that very lifetime.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་ཁྱབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: If you ask why, it is because bodhisattva great beings embrace all beings with loving kindness. {

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་པ་དེ་དག་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་ཉན་ཐོས་ཀྱི་ས་འམ་རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་དུ་འོང་ངོ་ཞེས་ཡོངས་སུ་བསྲུང་བ་མཛད་དོ། །རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་།
en: Dt.56} “All the lord buddhas who are present in the world systems of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, will also protect those bodhisattva great beings lest they regress to the level of the śrāvakas or the level of the pratyekabuddhas.

source: གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་། ཚངས་རིས་ཀྱི་ལྷ་རྣམས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་།
en: The gods of Caturmahā­rāja­kāyika and Trayastriṃśa, the gods of Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin, along with the gods of Brahmakāyika, and the gods of Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha will also protect those bodhisattva great beings lest certain obstacles occur.

source: གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ། ལ་ལ་ཞིག་བར་ཆད་བྱེད་པར་འགྱུར་དུ་འོང་ངོ་ཞེས་ཡོངས་སུ་བསྲུང་བ་བྱེད་དོ། །དེ་ལ་ལུས་ཀྱི་སྐྱོན་དུ་བྱ་བ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཚེ་འདི་ཉིད་ལ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པར་འགྱུར་རོ།
en: All the physical defects that they may have will also be completely eliminated in that very lifetime.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སྤྱོད་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་ཞེས་བྱའོ།
en: Śāradvatīputra, bodhisattva great beings who practice in that manner are said to engage with the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུངས་ཀྱི་སྒོ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། སྤོབས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་སྒོ་དག་ཀྱང་ཚེགས་མི་ཆེ་བར་མངོན་དུ་འགྱུར་རོ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, the meditative stabilities, the dhāraṇī gateways, and the gateways of the kinds of exact knowledge, including inspired speech, will manifest to them without great difficulty.

source: །སྐྱེ་བའི་སྐྱེ་མཆེད་ཐམས་ཅད་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མཉེས་པར་བྱེད་པར་འགྱུར་ཏེ།
en: Wherever they are reborn, they will please the tathāgatas, arhats, completely awakened buddhas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ།
en: They will never be separated from those lord buddhas until they attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། འདི་སྙམ་དུ་ཆོས་གང་ལ་ལ་ཆོས་རྣམས་ལ་འདུ་བའམ་འབྲལ་བར་འགྱུར་བ་འམ། འཕྲད་པ་འམ་མི་འཕྲད་པར་འགྱུར་བ་དེ་ལྟ་བུ་ཡོད་དམ་ཞེས་བྱ་བར་མི་སེམས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་ཆོས་གང་ཡང་འདུ་བའམ་འབྲལ་བར་འགྱུར་བའམ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they do not think, ‘Is there any phenomenon conjoined or disjoined with other phenomena?

source: འཕྲད་པ་འམ་མི་འཕྲད་པར་འགྱུར་བ་དེ་ལྟ་བུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Is there any such phenomenon that I will encounter or not encounter?’

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་འདི་སྙམ་དུ་བདག་གིས་ཆོས་ཀྱི་དབྱིངས་མངོན་པར་སངས་རྒྱས་པར་འགྱུར་རམ། འོན་ཏམ་མི་འགྱུར་ཞེས་བྱ་བར་མི་སེམས་ཏེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they do not think, ‘Will I manifestly awaken to the realm of phenomena or will I not?’ {

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་མངོན་པར་སངས་རྒྱས་པ་མེད་དོ།
en: Dt.57} If you ask why, the realm of phenomena does not manifestly awaken to the realm of phenomena.

source: །མངོན་པར་འཚང་རྒྱ་བ་མེད་དོ།
en: There is no manifest awakening.

source: །མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་བ་མེད་དོ།
en: There will be no manifest awakening.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ཡང་ཆོས་ཀྱི་དབྱིངས་དང་། ཐ་དད་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they do not observe anything at all that is different from the realm of phenomena.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་རྣམས་སུ་བྱེ་བྲག་ཏུ་བྱ་བ་མི་བྱེད་དེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they do not detail the realm of phenomena in terms of phenomena.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། འདི་སྙམ་དུ་ཆོས་ཀྱི་དབྱིངས་ཁོང་དུ་ཆུད་པར་འགྱུར་རམ་འོན་ཏམ་ཁོང་དུ་ཆུད་པར་མི་འགྱུར་ཞེས་བྱ་བར་མི་སེམས་ཏེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they do not think, ‘Will I comprehend the realm of phenomena, or will I not comprehend it?’

source: དེ་ནི་འདི་ལྟར་དེས་ཆོས་གང་གིས་ཆོས་གང་ཁོང་དུ་ཆུད་པར་བྱ་བ་དེ་ལྟ་བུའི་ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་མེད་དོ། །དེ་ཡང་འདི་ལྟར་དེ་ནི་ཆོས་ཀྱི་དབྱིངས་སྟོང་ཞེས་བྱ་བར་མི་སྦྱོར། མི་སྟོང་ཞེས་བྱ་བར་མི་སྦྱོར་རོ།
en: This is because they do not observe anything at all by which anything could be comprehended, and also because they do not engage with the notion that the realm of phenomena is empty, nor do they engage with the notion that it is not empty.

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་གཟུགས་སུ་མི་སྦྱོར་རོ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they do not associate physical forms with emptiness, nor do they associate emptiness with physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་རྣམ་པར་ཤེས་པར་མི་སྦྱོར་རོ།
en: They do not associate feelings, perceptions, formative predispositions, or consciousness with emptiness, nor do they associate emptiness with consciousness [or the other aggregates].

source: །མིག་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་མིག་ཏུ་མི་སྦྱོར་རོ།
en: They do not associate the eyes with emptiness, nor do they associate emptiness with the eyes.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་ཡིད་དུ་མི་སྦྱོར་རོ། །གཟུགས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར།
en: They do not associate the ears, nose, tongue, body, or mental faculty with emptiness, nor do they associate emptiness with the mental faculty [or the other sense organs].

source: སྟོང་པ་ཉིད་དང་གཟུགས་སུ་མི་སྦྱོར་རོ།
en: They do not associate sights with emptiness, nor do they associate emptiness with sights.

source: །སྒྲ་དང་། དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་ཆོས་སུ་མི་སྦྱོར་རོ།
en: They do not associate sounds, odors, tastes, tangibles, or mental phenomena with emptiness, nor do they associate emptiness with mental phenomena [or the other sense objects]. “

source: །མིག་གི་ཁམས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་མིག་གི་ཁམས་སུ་མི་སྦྱོར་རོ།
en: They do not associate the sensory element of the eyes with emptiness, nor do they associate emptiness with the sensory element of the eyes.

source: །གཟུགས་ཀྱི་ཁམས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་གཟུགས་ཀྱི་ཁམས་སུ་མི་སྦྱོར་རོ། །མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར།
en: They do not associate the sensory element of sights with emptiness, nor do they associate emptiness with the sensory element of sights.

source: སྟོང་པ་ཉིད་དང་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་སུ་མི་སྦྱོར་རོ། །རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་།
en: They do not associate the sensory element of visual consciousness with emptiness, nor do they associate emptiness with the sensory element of visual consciousness. {

source: རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་།
en: Dt.58} They do not associate the sensory element of the ears, the sensory element of sounds, the sensory element of auditory consciousness, the sensory element of the nose, the sensory element of odors, the sensory element of olfactory consciousness, the sensory element of the tongue, the sensory element of tastes, the sensory element of gustatory consciousness, the sensory element of the body, the sensory element of touch, the sensory element of tactile consciousness, or the sensory element of the mental faculty with emptiness, nor do they associate emptiness with the sensory element of the mental faculty [and so forth].

source: ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ཡིད་ཀྱི་ཁམས་དང་། སྟོང་པ་ཉིད་དུ་མི་སྦྱོར།
en: They do not associate the sensory element of mental phenomena with emptiness, nor do they associate emptiness with the sensory element of mental phenomena.

source: སྟོང་པ་ཉིད་དང་ཡིད་ཀྱི་ཁམས་སུ་མི་སྦྱོར་རོ། །ཆོས་ཀྱི་ཁམས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་ཆོས་ཀྱི་ཁམས་སུ་མི་སྦྱོར་རོ། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར།
en: They do not associate the sensory element of mental consciousness with emptiness, nor do they associate emptiness with the sensory element of mental consciousness. “

source: སྟོང་པ་ཉིད་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་སུ་མི་སྦྱོར་རོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དང་། སྟོང་པ་ཉིད་དུ་མི་སྦྱོར། སྟོང་པ་ཉིད་དང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མི་སྦྱོར་རོ།
en: They do not associate [all the attributes and goals], up to and including all-aspect omniscience, with emptiness, nor do they associate emptiness with all-aspect omniscience [and so forth].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་འདི་ནི་རྣལ་འབྱོར་དམ་པ་སྟེ།
en: If you ask why, Śāradvatīputra, it is because this union of emptiness is supreme union.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་ནི་ཉན་ཐོས་ཀྱིས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་མི་ལྟུང་ངོ་།
en: Śāradvatīputra, bodhisattva great beings who engage in emptiness do not regress to the level of the śrāvakas or the level of the pratyekabuddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འང་མྱུར་དུ་མངོན་པར་འཚང་རྒྱའོ།
en: They also refine the buddhafields, and they also bring beings to maturation. They will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་རྣལ་འབྱོར་དུ་བྱ་བ་གང་ཅི་ཡང་རུང་སྟེ། དེ་དག་གི་ནང་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་དེ་ནི་རབ་ཅེས་བྱའོ།
en: Śāradvatīputra, of all possible kinds of union to engage in, this union with the perfection of wisdom is said to be the best.

source: མཆོག་དང་། དམ་པ་དང་། ཕུལ་དང་། གཙོ་བོ་དང་། གྱ་ནོམ་པ་ཞེས་བྱའོ།
en: It is said to be supreme, the highest, perfect, foremost, and the most sublime.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་འདི་ནི། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་རྣལ་འབྱོར་ཏེ།
en: If you ask why, {Dt.59} it is because this union with the perfection of wisdom is a union with emptiness, signlessness, and wishlessness.

source: བླ་ན་མེད་པའི་རྣལ་འབྱོར་ཏོ།
en: It is the unsurpassed union.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལུང་བསྟན་པ་ཞེས་བྱ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་པའོ།
en: Śāradvatīputra, bodhisattva great beings who practice in that manner are said to be receiving their prophetic declaration, since they are approaching unsurpassed, complete enlightenment. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་དོན་བྱེད་ཀྱང་། དེ་འདི་སྙམ་དུ་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པ་ཡིན་ནོ་ཞེ་འམ་བརྩོན་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བར་མི་སེམས་སོ།
en: Śāradvatīputra, although bodhisattva great beings who practice in that manner act on behalf of countless, limitless beings, they do not think, ‘I am engaging in the perfection of wisdom,’ or ‘I am not engaging in it.’

source: །བདག་ལ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལུང་སྟོན་པ་མཛད་དོ།
en: They do not think, ‘I have been prophesied by the lord buddhas.

source: །བདག་ནི་ལུང་བསྟན་པ་ལ་ཉེ་བར་གྱུར་ཏོ།
en: I am about to be prophesied.

source: །བདག་གིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བར་བྱའོ།
en: I should refine the buddhafields.

source: །བདག་གིས་ནི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱའོ།
en: I should bring beings to maturation.

source: །བདག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཏེ།
en: I should attain manifest buddhahood in unsurpassed, complete enlightenment.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱའོ་སྙམ་དུ་མི་སེམས་སོ།
en: I should turn the wheel of the Dharma.’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ཆོས་ཀྱི་དབྱིངས་ལ་བྱེ་བྲག་ཏུ་བྱེད་པ་མེད་དོ།
en: If you ask why, it is because in the realm of phenomena no details are distinguished.

source: །དེ་ནི་ཆོས་ཀྱི་དབྱིངས་ལས་ཆོས་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའམ། གང་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ལུང་བསྟན་པར་བྱ་བ་འམ། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བ་དེ་ལྟ་བུའི་ཆོས་གཞན་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Apart from the realm of phenomena, they do not observe anyone at all who practices the perfection of wisdom, anyone whom the lord buddhas would prophesy, or anyone who would attain manifest buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་གྱི་འདུ་ཤེས་མི་སྐྱེའོ།
en: If you ask why, when bodhisattva great beings practice the perfection of wisdom, the perception of beings does not arise.

source: །བདག་དང་སྲོག་དང་འགྲོ་བ་དང་གསོ་བ་དང་སྐྱེས་བུ་དང་གང་ཟག་དང་ཤེད་ཅན་དང་ཤེད་བདག་དང་བྱེད་པ་པོ་དང་ཚོར་བ་པོ་དང་ཤེས་པ་པོ་དང་མཐོང་བ་པོའི་འདུ་ཤེས་མི་སྐྱེའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The perception of a self, life forms, life, living creatures, persons, human beings, people, actors, experiencers, knowers, and viewers does not arise.

source: དེ་ནི་འདི་ལྟར་སེམས་ཅན་ཤིན་ཏུ་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པའི་ཕྱིར་ཏེ། སེམས་ཅན་ལ་ནི་སྐྱེ་བ་དང་འགག་པ་མེད་དོ།
en: If you ask why, it is because beings absolutely do not arise, nor do they cease.

source: །གང་ལ་སྐྱེ་བ་དང་འགག་པ་མེད་པ་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་ཡང་ཇི་ལྟར་འགྱུར་ཏེ།
en: How would that which neither arises nor ceases practice the perfection of wisdom?

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་སྐྱེ་བ་མེད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན།
en: Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom in that manner practice the perfection of wisdom based on [the truth that] beings are nonarising.

source: སེམས་ཅན་སྟོང་པ་ཉིད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན།
en: They practice the perfection of wisdom based on [the truth that] beings are emptiness.

source: སེམས་ཅན་མི་དམིགས་པ་དང་། སེམས་ཅན་དབེན་པ་དང་། སེམས་ཅན་རང་བཞིན་མེད་པ་དང་། སེམས་ཅན་ངོ་བོ་ཉིད་མེད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ཏེ།
en: They practice the perfection of wisdom based on [the truths that] beings are nonapprehensible, that beings are void, that beings are without inherent existence, and that beings are without essential nature.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྣལ་འབྱོར་དམ་པ་སྟེ།
en: Śāradvatīputra, this is the supreme union of bodhisattva great beings.

source: འདི་ལྟར་སྟོང་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་ཏོ།
en: It is a union with emptiness.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་རྣལ་འབྱོར་ཏེ།
en: Śāradvatīputra, this is the union of bodhisattva great beings who practice the perfection of wisdom.

source: དེས་དེ་མ་ཡིན་པའི་རྣལ་འབྱོར་རྣམས་ཟིལ་གྱིས་མནན་ཏེ་གནས་སོ།
en: It endures when all other modes of union have been surpassed.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རྣལ་འབྱོར་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་མངོན་པར་བསྒྲུབ་བོ།
en: Śāradvatīputra, bodhisattva great beings who are engaged in this union will achieve the ten powers of the tathāgatas.

source: །མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མངོན་པར་བསྒྲུབ་བོ།
en: They will achieve the four fearlessnesses, the four kinds of exact knowledge, {Dt.60} great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣལ་འབྱོར་འདི་ལ་སྤྱོད་པ་ནི་སེར་སྣའི་སེམས་མི་བསྐྱེད་དོ།
en: Śāradvatīputra, bodhisattva great beings who maintain this union do not entertain thoughts of miserliness.

source: །ཚུལ་ཁྲིམས་ངན་པའི་སེམས་དང་། གནོད་པར་སེམས་པའི་སེམས་དང་། ལེ་ལོའི་སེམས་དང་། འཁྲུག་པའི་སེམས་དང་། ཤེས་རབ་འཆལ་པའི་སེམས་མི་བསྐྱེད་དོ།
en: They do not entertain thoughts of degenerate morality, thoughts of agitation, thoughts of indolence, thoughts of distraction, or thoughts of stupidity.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་འདིས་སྤྱོད་པ་དེ་གང་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པ་ལགས།
en: Śāradvatīputra then asked the Blessed One, “Blessed Lord, where will bodhisattva great beings who practice the perfection of wisdom in accordance with this union die and transmigrate, so as to be reborn here?

source: འདི་ནས་ཤི་འཕོས་ནས་ནི་གང་དུ་སྐྱེ་བར་འགྱུར།
en: And where will they be reborn when they have died and transmigrated from here?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་འདིས་རྣམ་པར་སྤྱོད་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པའམ། དགའ་ལྡན་གྱི་ལྷའི་རིས་དང་མིའི་ནང་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པར་ཤེས་པར་བྱའོ།
en: Śāradvatīputra,” replied the Blessed One, “you should know that great bodhisattva beings who practice the perfection of wisdom in accordance with this union have died and transmigrated from other buddhafields, so as to be reborn here, or else they have died and transmigrated from the god realm of Tuṣita or from the human realm, so as to be reborn here.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པ་དེ་ནི། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་ལ། རྣལ་འབྱོར་མྱུར་དུ་འགྲུབ་པ་སྟེ།
en: In this regard, Śāradvatīputra, those bodhisattva great beings who have died and transmigrated from other buddhafields so as to be reborn here will swiftly achieve that union, union with the perfection of wisdom.

source: ཚེ་རབས་འདི་འདས་ནས་ཀྱང་ཆོས་ཟབ་མོ་འདི་དག་དེ་ལ་མངོན་དུ་འགྱུར་རོ། །དེ་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་ལ་མཉམ་པར་གཞག་གོ །
en: After they have passed away from this life, too, those profound dharmas will be manifest to them, and from then on they will be absorbed in union with the perfection of wisdom.
